Sep-29-backup-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-29 Fri 21:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Project 2 Notes</title>
<meta name="author" content="Tianyu Chen" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Project 2 Notes</h1>
<p>
<a href="https://iudatastructurescourse.github.io/course-web-page-fall-2023/">🔙HOME</a>
</p>





<div id="outline-container-org9cb067b" class="outline-2">
<h2 id="org9cb067b">First Things First</h2>
<div class="outline-text-2" id="text-org9cb067b">
<p>
<b>Quiz 2.</b> 15 minutes, closed-book
</p>

<ul class="org-ul">
<li>On Canvas: <a href="https://iu.instructure.com/courses/2165834/quizzes/4049366">link</a></li>
<li>Multiple choices: <b>select ALL answers that apply!</b></li>
<li>Access code: <span class="underline">binary</span></li>
</ul>
</div>
</div>






<div id="outline-container-org23782e8" class="outline-2">
<h2 id="org23782e8">Segment Intersection (AVL Trees)</h2>
<div class="outline-text-2" id="text-org23782e8">
</div>
<div id="outline-container-org1cd4527" class="outline-3">
<h3 id="org1cd4527">Project Overview and General Remarks</h3>
<div class="outline-text-3" id="text-org1cd4527">
<ul class="org-ul">
<li>The line sweep algorithm is provided to you
<ul class="org-ul">
<li>No need to worry about the segment intersection
algorithm per se, just the data structures used</li>
</ul></li>
<li>Implement <code>BinarySearchTree</code> and <code>AVLTree</code>
<ul class="org-ul">
<li><code>BinarySearchTree</code> <i>implements</i> the <code>OrderedSet</code> interface:
<ul class="org-ul">
<li><code>height()</code>: <b>need to maintain the height during operations</b></li>
<li><code>search()</code>, <code>contains()</code>, <code>insert()</code>, <code>remove()</code>:
<a href="https://iudatastructurescourse.github.io/course-web-page-fall-2023/lectures/Sep-13">lecture notes</a></li>
<li><code>keys()</code>: in-order traversal of the BST
<ul class="org-ul">
<li>returns a sorted list</li>
</ul></li>
</ul></li>
<li><code>AVLTree</code> <i>extends</i> <code>BinarySearchTree</code> by overriding:
<ul class="org-ul">
<li><code>insert()</code>: balance the tree by (single, double) rotations</li>
<li><code>remove()</code>: balance the tree by (single, double) rotations
<ul class="org-ul">
<li>Where, when, how?
(We'll find out later)</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org12a1a12" class="outline-3">
<h3 id="org12a1a12">BST Implementation Details</h3>
<div class="outline-text-3" id="text-org12a1a12">
</div>
<div id="outline-container-org56e12e9" class="outline-4">
<h4 id="org56e12e9">One caveat of <code>insert()</code>&#x2026;</h4>
<div class="outline-text-4" id="text-org56e12e9">
<p>
We should note that the <a href="https://en.wikipedia.org/wiki/Design_by_contract">contracts</a> of <code>insert()</code> are different
between the student support code version and the textbook
version, so a direct copy-and-paste apparently won't work!
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #ba2f59; font-weight: bold;">Node</span><span style="color: #3a81c3;">&lt;</span><span style="color: #ba2f59; font-weight: bold;">K</span><span style="color: #3a81c3;">&gt;</span> <span style="color: #6c3163; font-weight: bold;">insert</span><span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">K</span> <span style="color: #715ab1;">key</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">... YOUR CODE</span>
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<ul class="org-ul">
<li>Your code is expected to return (quote the support code):
"the location where the insert occurred", that is, a reference
to the newly-inserted node.</li>
<li>However, the code in the book returns the root of the tree.</li>
</ul>

<p>
You need to adapt the code&#x2026;
</p>

<p>
Also, make sure to update:
</p>
<ul class="org-ul">
<li><b>height</b> (<code>updateHeight()</code>) for all ancestors</li>
<li><b>size of the tree</b> (<code>numNodes</code>)</li>
</ul>

<p>
Same for <code>remove()</code>. The height of an empty tree is \(-1\):
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #3a81c3; font-weight: bold;">static</span> <span style="color: #3a81c3; font-weight: bold;">protected</span> <span style="color: #3a81c3;">&lt;</span><span style="color: #ba2f59; font-weight: bold;">K</span><span style="color: #3a81c3;">&gt;</span> <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #6c3163; font-weight: bold;">get_height</span><span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Node</span><span style="color: #6c3163;">&lt;</span><span style="color: #ba2f59; font-weight: bold;">K</span><span style="color: #6c3163;">&gt;</span> <span style="color: #715ab1;">n</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
    <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #6c3163;">(</span>n == <span style="color: #4e3163;">null</span><span style="color: #6c3163;">)</span> <span style="color: #3a81c3; font-weight: bold;">return</span> -<span style="color: #4e3163;">1</span>;
    <span style="color: #3a81c3; font-weight: bold;">else</span> <span style="color: #3a81c3; font-weight: bold;">return</span> n.height;
<span style="color: #3a81c3;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org42161d4" class="outline-4">
<h4 id="org42161d4">Possible helper functions</h4>
<div class="outline-text-4" id="text-org42161d4">
<p>
Optional. You may do it differently.
</p>
</div>

<ul class="org-ul">
<li><a id="orga633913"></a><code>set_left()</code> and <code>set_right()</code>: setting the children of a node<br />
<div class="outline-text-5" id="text-orga633913">
<p>
Question: how to set the left child of <code>n</code> to be <code>l</code>?
</p>

<ul class="org-ul">
<li>Previously we used <code>n.left = l</code> in the lecture.
<ul class="org-ul">
<li>Does it still work?
<ul class="org-ul">
<li>No. It doesn't set the parent of <code>l</code> to be <code>n</code>.</li>
<li>We didn't have <code>parent</code> in the BST lecture.</li>
</ul></li>
<li>But why do we need <code>parent</code> this time?
<ul class="org-ul">
<li>Hint: <a href="https://iudatastructurescourse.github.io/course-web-page-fall-2023/lab4">Lab 4</a></li>
</ul></li>
</ul></li>
<li>Define two helper functions. Each does 3 things:
<ol class="org-ol">
<li><code>n.left = l</code> (or <code>n.right = r</code>)</li>
<li><code>l.parent = n</code> if <code>l != null</code></li>
<li>update the height of <code>n</code> - why?</li>
</ol></li>
</ul>
</div>
</li>

<li><a id="org686205d"></a><code>replace()</code>: replace a tree<br />
<div class="outline-text-5" id="text-org686205d">
<p>
Replace a tree with root <code>n</code> with another tree with root <code>m</code>,
we case split on the parent of <code>n</code>, producing 3 cases:
</p>

<ol class="org-ol">
<li>no parent (<code>n.parent == null</code>)</li>
<li>has parent and <code>n</code> is left child (<code>n == n.parent.left</code>)
<ul class="org-ul">
<li>set the left child of parent to be <code>m</code></li>
</ul></li>
<li>has parent and <code>n</code> is right child (<code>n == n.parent.right</code>)
<ul class="org-ul">
<li>set the right child of parent to be <code>m</code></li>
</ul></li>
</ol>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6b74b0b" class="outline-3">
<h3 id="org6b74b0b">AVL Specific Implementation Details</h3>
<div class="outline-text-3" id="text-org6b74b0b">
<p>
Do normal BST insert or remove.
Fix the AVL property using <code>balance()</code>.
</p>
</div>

<div id="outline-container-orga62801e" class="outline-4">
<h4 id="orga62801e">Where to re-balance?</h4>
<div class="outline-text-4" id="text-orga62801e">
<p>
Quote textbook p. 125:
</p>

<blockquote>
<p>
We will show how to re-balance the tree at the first
(i.e., deepest) such node, and we will prove that this
re-balancing guarantees that the entire tree satisfies
the AVL property.
</p>
</blockquote>

<p>
Slightly confusing. In fact, we need to re-balance the tree
from the current node of the operation, <code>insert()</code> or <code>remove()</code>,
<b>all the way up</b> to the root node!
</p>

<p>
If you define <code>insert()</code> and <code>remove()</code> recursively,
you need to call <code>balance()</code> on the current root of the
sub-tree before you return.
</p>

<p>
Update the height whenever we re-balance a node.
</p>
</div>
</div>

<div id="outline-container-orge69f187" class="outline-4">
<h4 id="orge69f187">When to re-balance?</h4>
<div class="outline-text-4" id="text-orge69f187">
<p>
This is where height comes into play. <code>isAVL()</code> is defined as:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #3a81c3; font-weight: bold;">static</span> <span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Node</span><span style="color: #3a81c3;">&lt;</span><span style="color: #ba2f59; font-weight: bold;">K</span><span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3; font-weight: bold;">implements</span> <span style="color: #ba2f59; font-weight: bold;">Location</span><span style="color: #3a81c3;">&lt;</span><span style="color: #ba2f59; font-weight: bold;">K</span><span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">{</span>
    <span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #ba2f59; font-weight: bold;">boolean</span> <span style="color: #6c3163; font-weight: bold;">isAVL</span><span style="color: #6c3163;">()</span> <span style="color: #6c3163;">{</span>
        <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">h1</span>, <span style="color: #715ab1;">h2</span>;
        h1 = get_height<span style="color: #2d9574;">(</span>left<span style="color: #2d9574;">)</span>;
        h2 = get_height<span style="color: #2d9574;">(</span>right<span style="color: #2d9574;">)</span>;
        <span style="color: #3a81c3; font-weight: bold;">return</span> Math.abs<span style="color: #2d9574;">(</span>h2 - h1<span style="color: #2d9574;">)</span> &lt; <span style="color: #4e3163;">2</span>;
    <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>

<span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">AVLTree</span><span style="color: #3a81c3;">&lt;</span><span style="color: #ba2f59; font-weight: bold;">K</span><span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3; font-weight: bold;">extends</span> <span style="color: #ba2f59; font-weight: bold;">BinarySearchTree</span><span style="color: #3a81c3;">&lt;</span><span style="color: #ba2f59; font-weight: bold;">K</span><span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">{</span>
    <span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #ba2f59; font-weight: bold;">boolean</span> <span style="color: #6c3163; font-weight: bold;">isAVL</span><span style="color: #6c3163;">()</span> <span style="color: #6c3163;">{</span>
        <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>root == <span style="color: #4e3163;">null</span><span style="color: #2d9574;">)</span>
            <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #4e3163;">true</span>;
        <span style="color: #3a81c3; font-weight: bold;">else</span>
            <span style="color: #3a81c3; font-weight: bold;">return</span> root.isAVL<span style="color: #2d9574;">()</span>;
    <span style="color: #6c3163;">}</span>
  <span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
A tree is an AVL tree (balanced) if:
</p>
<ol class="org-ol">
<li>it is empty, or</li>
<li>the height difference of its two sub-trees \(<2\)</li>
</ol>

<p>
We re-balance when the tree is <i>not</i> AVL.
</p>
</div>
</div>

<div id="outline-container-org2b031ee" class="outline-4">
<h4 id="org2b031ee">How to re-balance? Rotations</h4>
<div class="outline-text-4" id="text-org2b031ee">
</div>
<ul class="org-ul">
<li><a id="orge948083"></a>Single rotations: <code>right_rotate()</code> and <code>left_rotate()</code><br />
<div class="outline-text-5" id="text-orge948083">
<p>
Consider right rotate (book Figure 4.40),
is the following code correct?
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #3a81c3; font-weight: bold;">private</span> <span style="color: #ba2f59; font-weight: bold;">Node</span> <span style="color: #6c3163; font-weight: bold;">right_rotate</span><span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Node</span> <span style="color: #715ab1;">y</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
    <span style="color: #ba2f59; font-weight: bold;">Node</span> <span style="color: #715ab1;">x</span> = y.left;
    set_left<span style="color: #6c3163;">(</span>y, x.right<span style="color: #6c3163;">)</span>;
    set_right<span style="color: #6c3163;">(</span>x, y<span style="color: #6c3163;">)</span>;
    <span style="color: #3a81c3; font-weight: bold;">return</span> x;
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
Left rotate is the mirror of right rotate.
</p>
</div>
</li>

<li><a id="orgfa12934"></a>Double rotations<br />
<div class="outline-text-5" id="text-orgfa12934">
<p>
Book Figure 4.43
</p>
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-09-29 Fri 00:00</p>
<p class="author">Author: Tianyu Chen</p>
<p class="date">Created: 2023-09-29 Fri 21:19</p>
</div>
</body>
</html>